Tekla Open API Reference for Tekla Structures 2025
Localization.Language Property
 Gets or sets the language that is currently used in Tekla Structures.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Language { get; set; }
Public Property Language As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace